/*
HW1 Part 2
___________________________________________________

11. В проекте JavaForBeginners05, который мы создали на уроке, открыть класс Teacher

12. В классе Teacher создать “объект”:
Учитель математики Иван Петрович Серебряков, 55 лет

13. Создать и распечатать карточку учителя математики (постарайтесь придумать свой “дизайн”,
но можно распечатать так же, как карточку Марь Иванны с урока)
 */


package lessons;

public class Teacher extends Person {

    public static void main(String[] args) {

        System.out.println("************************************\n"
                + "\tFirst name: \tRyan \n"
                + "\tMiddle name: \tThomas \n"
                + "\tLast name: \t\tGosling\n"
                + "\tAge: \t\t\t43 y.o. \n"
                + "************************************");
    }
}
