/*
Part 1
___________________________________________________

1. Открыть IntelliJ Idea и создать новый проект с названием NextProject

2. В проекте NextProject найти папку src

3. В папке src создать новый Java class с вашим именем и фамилией, написанными в camelCase

4. В новом классе создать точку входа в программу

5. Запустить программу и убедиться, что она выполнена с кодом 0

6. Создать в папке src пакет my_cool_work

7. В пакете my_cool_work создать еще один класс с названием 123

8. В папке src создать класс с названием !”№;%

9. Закрыть проект

10. Удалить проект NextProject


Part 2 is in the lessons folder


Part 2
___________________________________________________

20. проекте JavaForBeginners05 создать класс HW1

21. В классе HW1 создать две переменные a и b типа int и присвоить им значения 10 и 20 coответственно

22. Cоздать целочисленную переменную s, и присвоить ей значение 100

23. Cоздать целочисленную переменную t, и присвоить ей значение переменной s

24. В классе HW1 создать переменную myNameInSlack и присвоить ей соответствующее значение
 */


package homework;

public class HW1 {

    public static void main(String[] args) {

        int a = 10;
        int b = 20;
        int s = 100;
        int t = s;

        String myNameInSlack = "Anna B";
    }
}
